In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,5),['A','B','C','D','E'],['V','W','X','Y','Z'])

In [6]:
df

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [8]:
booldf = df>0

In [9]:
df[booldf]

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B       NaN       NaN  0.605965       NaN  0.740122
C  0.528813       NaN  0.188695       NaN       NaN
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723       NaN       NaN       NaN

In [10]:
df

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [12]:
df[df['W']>0]

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [14]:
df[df['Z']<0]

          V         W         X         Y         Z
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [18]:
resultdf = df[df['W']>0]['X']

In [19]:
resultdf

A    0.907969
D    1.978757
E   -1.706086
Name: X, dtype: float64

In [20]:
booldf = df['W']>0

In [24]:
result = df[booldf]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.503826  0.907969
D  2.605967  1.978757
E -1.159119 -1.706086

In [27]:
df[(df['W']>0)&(df['X']>1)]

          V         W         X         Y         Z
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [28]:
newind = 'CA NY WY OR CO'.split()

In [30]:
df['States']=newind

In [35]:
df.set_index('States', inplace=True)

In [37]:
df

               V         W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826  0.651118
NY     -0.319318 -0.848077  0.605965 -2.018168  0.740122
WY      0.528813 -0.589001  0.188695 -0.758872 -0.933237
OR      0.955057  0.190794  1.978757  2.605967  0.683509
CO      0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [44]:
#Index levels

In [47]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [49]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.482495  0.961458
   2 -2.141212  0.992573
   3  1.192241 -1.046780
G2 1  1.292765 -1.467514
   2 -0.494095 -0.162535
   3  0.485809  0.392489

In [55]:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    1.482495  0.961458
       2   -2.141212  0.992573
       3    1.192241 -1.046780
G2     1    1.292765 -1.467514
       2   -0.494095 -0.162535
       3    0.485809  0.392489

In [59]:
df.loc['G2'].loc[2]['B']

-0.1625347347726149

In [61]:
df.xs(1,level='Num')

               A         B
Groups
G1      1.482495  0.961458
G2      1.292765 -1.467514